## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # zentral_monolith_sub_manifest_pkg_info.firefox will be created
  + resource "zentral_monolith_sub_manifest_pkg_info" "firefox" {
      + default_shard    = 100
      + excluded_tag_ids = []
      + featured_item    = false
      + id               = (known after apply)
      + key              = "managed_installs"
      + pkg_info_name    = "Firefox"
      + shard_modulo     = 100
      + sub_manifest_id  = 2
      + tag_shards       = []
    }

  # zentral_santa_rule.teamid-macpaw will be created
  + resource "zentral_santa_rule" "teamid-macpaw" {
      + configuration_id        = 1
      + custom_message          = "No Stickies..."
      + description             = "Block all the stickies"
      + excluded_primary_users  = []
      + excluded_serial_numbers = []
      + excluded_tag_ids        = []
      + id                      = (known after apply)
      + policy                  = "BLOCKLIST"
      + primary_users           = []
      + ruleset_id              = (known after apply)
      + serial_numbers          = []
      + tag_ids                 = []
      + target_identifier       = "platform:com.apple.Stickies"
      + target_type             = "SIGNINGID"
      + version                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>